{
  "backend/main.mo": "Motoko actor implementing contact form and service request submission with validation, storage in maps keyed by email/timestamp, and query functions to retrieve all contacts and service requests sorted by timestamp.",
  "feature_evidence.json": "Feature evidence report documenting four LG branding features covering logo replacement, comprehensive theme application, background/border updates, and icon/badge styling across frontend components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing LG-branded components, hooks, styling with LG Heritage Red (#A50034), and service center page structure.",
  "frontend/index.css": "Tailwind CSS base layer defining OKLCH color system variables for light and dark modes with neutral grays and whites for backgrounds, borders, and text colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the 24x7 Care Customer Support Interface application.",
  "frontend/src/App.tsx": "Root React component rendering Header, ServiceCenterPage, and Footer in a flex column layout with background styling.",
  "frontend/src/components/ApplianceCategoryGrid.tsx": "Responsive grid displaying six appliance categories with icons, descriptions, and click handlers that scroll to the service form with hover effects using primary color accents.",
  "frontend/src/components/ContactForm.tsx": "Contact form card component with name, email, and message fields, client-side validation, mutation hook for backend submission, and cancel/success callbacks with primary color focus states.",
  "frontend/src/components/ContactInfo.tsx": "Three-column grid displaying contact details (phone, email, location) in cards with primary-colored icons and hover shadow effects.",
  "frontend/src/components/FAQ.tsx": "Accordion component displaying five frequently asked questions about service turnaround, warranty, coverage areas, costs, and scheduling with primary color hover states.",
  "frontend/src/components/Footer.tsx": "Renders a footer component displaying copyright information for LG Electronics and a link to caffeine.ai with UTM tracking parameters based on the current hostname.",
  "frontend/src/components/Header.tsx": "Renders a header component with the LG Electronics logo, a wrench icon, and the tagline \"Life's Good\".",
  "frontend/src/components/ServiceFeatures.tsx": "Displays a grid of four service feature cards (24/7 Support, Certified Technicians, Genuine Parts, Warranty Service) with icons and descriptions.",
  "frontend/src/components/ServiceRequestForm.tsx": "Provides a form for submitting service requests with fields for appliance type, model number, issue description, customer name, and email, with success message handling and mutation integration.",
  "frontend/src/components/SuccessMessage.tsx": "Displays a dismissible success alert message confirming that a message has been sent successfully.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching contact forms and service requests from the backend actor, including queries for all contacts, contact by email, and all service requests.",
  "frontend/src/hooks/useServiceRequestMutation.ts": "Provides a mutation hook for submitting service requests to the backend actor and invalidating the service requests query cache on success.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark themes using LG Heritage Red (#A50034) as the primary brand color.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/ServiceCenterPage.tsx": "Main landing page component that renders a hero section and multiple sections including appliance categories, service features, request form, FAQ, and contact information.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, container settings, border radius variables, custom shadows, and accordion animations.",
  "project_state.json": "Project metadata tracking LG-branded service center features, known issues (incorrect LG logo), and image requirements for official LG logo with specific dimensions."
}