{
  "backend/main.mo": "Motoko actor defining contact form and service request submission/retrieval endpoints with validation, timestamp tracking, and sorted queries.",
  "feature_evidence.json": "Feature evidence report documenting the LG logo replacement in the Header component with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing LG-branded components, pages, hooks, and styling with red primary color theme.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark modes, defining neutral grayscale palette for LG brand theming.",
  "frontend/index.html": "HTML entry point with title '24x7 Care Customer Support Interface' and root div for React mounting.",
  "frontend/src/App.tsx": "Root React component rendering ServiceCenterPage wrapped with Header and Footer in a flex column layout.",
  "frontend/src/components/ApplianceCategoryGrid.tsx": "Grid of six appliance category cards with icons, descriptions, and click-to-scroll functionality to the service form.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with name, email, and message fields, validation, mutation hook for backend submission, and success/cancel callbacks.",
  "frontend/src/components/ContactInfo.tsx": "Three-column grid displaying contact details (phone, email, coverage) with icons and descriptions in card layout.",
  "frontend/src/components/FAQ.tsx": "Accordion component displaying five frequently asked questions about service turnaround, warranty, coverage, cost, and scheduling.",
  "frontend/src/components/Footer.tsx": "Footer with LG Electronics copyright, LG Service Center branding, and caffeine.ai attribution with UTM tracking and primary-colored heart icon.",
  "frontend/src/components/Header.tsx": "Header displaying LG Electronics logo image (400x150), wrench icon, and 'Life's Good' tagline with border and backdrop blur styling.",
  "frontend/src/components/ServiceFeatures.tsx": "Four-column grid showcasing service benefits (24/7 support, certified technicians, genuine parts, warranty) with icons and descriptions.",
  "frontend/src/components/ServiceRequestForm.tsx": "React form component for submitting appliance service requests with fields for appliance type, model number, issue description, and customer details. Displays success alerts and uses a mutation hook to submit data to the backend.",
  "frontend/src/components/SuccessMessage.tsx": "Reusable success alert component that displays a confirmation message with a close button. Uses lucide-react icons and shadcn/ui Alert components.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance based on Internet Identity authentication state. Automatically recreates the actor when identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages AuthClient lifecycle, identity persistence, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching contact forms and service requests from the backend actor. Includes queries for all contacts, individual contacts by email, and all service requests.",
  "frontend/src/hooks/useServiceRequestMutation.ts": "React Query mutation hook for submitting service requests to the backend actor. Invalidates the service requests query cache on successful submission.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining the LG brand color scheme (Heritage Red primary) for both light and dark modes. Includes design tokens for backgrounds, borders, and UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component. Initializes QueryClient for data fetching and caching.",
  "frontend/src/pages/ServiceCenterPage.tsx": "Main service center landing page component that composes multiple sections including hero banner, appliance categories, service features, request form, FAQ, and contact information. Provides a complete service center experience.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color tokens using OKLCH color space, extends theme with custom colors (primary, secondary, destructive, muted, accent, sidebar, chart), border radius variables, custom shadows, and accordion animations. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file documenting an LG-branded home appliances repair service center page with features including appliance category sections, service request forms, FAQ, contact information, and LG branding (red #A50034 color scheme, LG logo, LG Smart font). Tracks 11 existing features and their requirement IDs."
}